; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v1 - type_3 ?v6 - type_1)
 	      (pred_2 ?v7 - object ?v6 - type_1)
	      (pred_1 ?v1 - type_3 ?v2 - type_2)
	      (pred_4 ?v1 - type_3 ?v7 - object ?v2 - type_2))

   (:action op_2
       :parameters  (?v1 - type_3 ?v4 ?v8 - type_1)
       :precondition (and  (pred_3 ?v1 ?v4))
       :effect (and  (pred_3 ?v1 ?v8)
		     (not (pred_3 ?v1 ?v4))))

   (:action op_1
       :parameters (?v1 - type_3 ?v3 - object ?v5 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v5) (pred_3 ?v1 ?v5) (pred_1 ?v1 ?v2))
       :effect (and (pred_4 ?v1 ?v3 ?v2)
		    (not (pred_2 ?v3 ?v5)) 
		    (not (pred_1 ?v1 ?v2))))

   (:action op_3
       :parameters (?v1 - type_3 ?v3 - object ?v5 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v3 ?v2) (pred_3 ?v1 ?v5))
       :effect (and (pred_2 ?v3 ?v5)
		    (pred_1 ?v1 ?v2)
		    (not (pred_4 ?v1 ?v3 ?v2)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_08 obj_12 - type_3
obj_01 obj_09 obj_11 obj_05 - type_2
obj_04 obj_02 obj_06 - type_1
obj_07 obj_10 obj_03 - object)
(:init
(pred_3 obj_08 obj_02)
(pred_1 obj_08 obj_01)
(pred_1 obj_08 obj_09)
(pred_3 obj_12 obj_04)
(pred_1 obj_12 obj_11)
(pred_1 obj_12 obj_05)
(pred_2 obj_07 obj_04)
(pred_2 obj_10 obj_04)
(pred_2 obj_03 obj_06)
)
(:goal
(and
(pred_2 obj_07 obj_02)
(pred_2 obj_10 obj_06)
(pred_2 obj_03 obj_02)
)
)

(:constraints
  (always (not (pred_3 obj_08 obj_06)))
)
)

; plan
1. (op_2 obj_08 obj_02 obj_04)
   deleted: (pred_3 obj_08 obj_02)
   added: (pred_3 obj_08 obj_04)
   goals met: 0 of 3
2. (op_1 obj_12 obj_10 obj_04 obj_05)
   deleted: (pred_2 obj_10 obj_04) (pred_1 obj_12 obj_05)
   added: (pred_4 obj_12 obj_10 obj_05)
   goals met: 0 of 3
3. (op_2 obj_12 obj_04 obj_06)
   deleted: (pred_3 obj_12 obj_04)
   added: (pred_3 obj_12 obj_06)
   goals met: 0 of 3
4. (op_1 obj_08 obj_07 obj_04 obj_09)
   deleted: (pred_2 obj_07 obj_04) (pred_1 obj_08 obj_09)
   added: (pred_4 obj_08 obj_07 obj_09)
   goals met: 0 of 3
5. (op_2 obj_08 obj_04 obj_02)
   deleted: (pred_3 obj_08 obj_04)
   added: (pred_3 obj_08 obj_02)
   goals met: 0 of 3
6. (op_3 obj_12 obj_10 obj_06 obj_05)
   deleted: (pred_4 obj_12 obj_10 obj_05)
   added: (pred_2 obj_10 obj_06) (pred_1 obj_12 obj_05)
   goals met: 1 of 3
7. (op_1 obj_12 obj_03 obj_06 obj_11)
   deleted: (pred_2 obj_03 obj_06) (pred_1 obj_12 obj_11)
   added: (pred_4 obj_12 obj_03 obj_11)
   goals met: 1 of 3
8. (op_2 obj_12 obj_06 obj_02)
   deleted: (pred_3 obj_12 obj_06)
   added: (pred_3 obj_12 obj_02)
   goals met: 1 of 3
9. (op_3 obj_08 obj_07 obj_02 obj_09)
   deleted: (pred_4 obj_08 obj_07 obj_09)
   added: (pred_2 obj_07 obj_02) (pred_1 obj_08 obj_09)
   goals met: 2 of 3
10. (op_3 obj_12 obj_03 obj_02 obj_11)
   deleted: (pred_4 obj_12 obj_03 obj_11)
   added: (pred_2 obj_03 obj_02) (pred_1 obj_12 obj_11)
   goals met: 3 of 3
